FVM_WD/Pipe_3D/pressure_correction/compressible/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {

	solver          PCG;
        preconditioner  FDIC; //DIC FDIC diagonal GAMG
        tolerance       1e-06;
        relTol          0.01;

/*
	solver          PBiCGStab;
        preconditioner  FDIC;
        tolerance       1e-06;
        relTol          0.01;
*/

/*
        solver          smoothSolver;
        //smoother  	symGaussSeidel;
        smoother  		FDIC;
        tolerance       1e-06;
        relTol          0.01;
*/

/*
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-05;
            relTol          0;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration on;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-06;
        relTol          0.01;
*/

/*
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
*/
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "rho.*"
    {
        solver diagonal;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minTier		1;
    }

    "h.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor yes;

    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;

}

relaxationFactors
{
    fields
    {
        ".*"   0.9;  // ensure diagonal equality
    }
    equations
    {
        ".*"   0.9;  // ensure diagonal equality
    }
}

// ************************************************************************* //
